Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/gpio.c
  const uint8_t pin_mask = (uint8_t)(k_gpio_bit_set << pin_num);

  /* Set as GPIO mode (not peripheral) */
  port_base->pmr &= (uint8_t)~pin_mask;

  /* Set as output */
  port_base->pdr |= pin_mask;

  rx_log_debug("GPIO", "Pin configured as output");

  return k_rx_ok;
}

/**
 * @brief Configure GPIO pin as digital input
 *
 * @details
 * Configures a GPIO pin for digital input mode. This function performs:
 * 1. Parameter validation (port and pin number)
 * 2. Pin reservation via the global pin validator (conflict detection)
 * 3. PMR register clear (select GPIO mode instead of peripheral function)
 * 4. PDR register clear (configure as input direction)
 *
 * ## Register Operations
 *
 * ```
 * PMR &= ~(1 << pin)  // Clear bit: Select GPIO mode (not peripheral)
 * PDR &= ~(1 << pin)  // Clear bit: Configure as input
 * ```
 *
 * ## Pull-up Configuration
 *
 * This function does NOT configure internal pull-up resistors. To enable
 * pull-ups, additional configuration of the PCR register is required.
 *
 * ## Reading Input State
 *
 * After configuration, use gpio_read() to read the current pin state.
 * The PIDR register is read for input state, not PODR.
 *
 * @param[in] pin Pin identifier encoded as rx_port_pin_t
 *                Use RX_PORT_PIN() macro: RX_PORT_PIN(port, pin_num)
 *                Example: RX_PORT_PIN(2, 0) for Port 2, Pin 0
 *
 * @return rx_err_t Configuration result
 * @retval k_rx_ok Pin successfully configured as input
 * @retval k_rx_err_gpio_invalid_port Port number in pin is invalid
 * @retval k_rx_err_gpio_invalid_pin Pin number exceeds k_rx_pin_max
 * @retval k_rx_err_rtos_mutex Pin validator mutex error (rare)
 *
 * @pre Pin must be a valid GPIO-capable pin on RX72N
 * @pre System infrastructure should be initialized (for pin validation)
 *
 * @post Pin is configured as GPIO input
 * @post PMR bit for pin is cleared (GPIO mode)
 * @post PDR bit for pin is cleared (input direction)
 * @post Pin is reserved in validator (if available)
 *
 * @note Thread-safe: Pin reservation uses mutex
 * @note Performance: ~1-2 µs @ 240 MHz (includes reservation)
 * @note Pull-ups: Not enabled by this function (use PCR register)
 *
 * @warning Floating inputs may read unpredictable values - use pull-up/pull-down
 * @warning Do not call from ISR (pin reservation may block)
 *
 * @par Example:
 * @code
 * // Configure button pin as input
 * rx_err_t err = gpio_set_input(RX_PORT_PIN(2, 0));  // Port 2, Pin 0
 * if (err != k_rx_ok) {
 *   rx_log_error("BTN", "Failed to configure button pin");
 *   return err;
 * }
 *
 * // Read button state
 * bool pressed;
 * err = gpio_read(RX_PORT_PIN(2, 0), &pressed);
 * if (err == k_rx_ok && pressed) {
 *   rx_log_info("BTN", "Button pressed");
 * }
 * @endcode
 *
 * @see gpio_set_output() Configure pin as output
 * @see gpio_read() Read input pin state
 * @see RX_PORT_PIN() Macro to create rx_port_pin_t
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 2 preconditions, 4 postconditions
 */
rx_err_t gpio_set_input(const rx_port_pin_t pin)
{
  /* Extract port and pin number from rx_port_pin_t */
  const uint8_t             port      = rx_port_from_pin(pin);
  const uint8_t             pin_num   = rx_pin_from_pin(pin);
  const rx_pin_interface_t* pin_iface = nullptr;

  /* Validate parameters */
  rx_err_t err = internal_validate_port_pin(port, pin_num);
  RX_RETURN_ON_ERROR(err, "GPIO", "Port/pin validation failed");

  /* Reserve pin through global pin validator */
  pin_iface = rx_infrastructure_get_pin_interface();
  if (pin_iface != nullptr) {
    err = pin_iface->reserve_pin(pin_iface->ctx, port, pin_num, "GPIO_IN");
    if (err != k_rx_ok && err != k_rx_err_gpio_conflict) {
      /* Allow conflict (pin already reserved), but fail on other errors */
      RX_RETURN_ON_ERROR(err, "GPIO", "Pin reservation failed");
    }
  }

  /* Get port base address */
  volatile rx_port_regs_t* port_base = rx_port_get_base(port);

  /* Set as GPIO mode */
  const uint8_t pin_mask = (uint8_t)(k_gpio_bit_set << pin_num);
  port_base->pmr &= (uint8_t)~pin_mask;

  /* Set as input */
  port_base->pdr &= (uint8_t)~pin_mask;

  rx_log_debug("GPIO", "Pin configured as input");

  return k_rx_ok;
}

/**
 * @brief Set GPIO output pin to logic high (3.3V)
 *
 * @details
 * Sets a GPIO output pin to logic high level. On the RX72N, this means
 * the pin outputs VCC (typically 3.3V). The pin must be configured as
 * an output before calling this function.
 *
 * ## Register Operation
 *
 * ```
 * PODR |= (1 << pin)  // Set bit: Output high
 * ```
 *
 * ## Timing
 *
 * The output level changes on the next peripheral clock cycle after the
 * register write completes. GPIO toggle rate is limited by bus speed.
 *
 * @param[in] pin Pin identifier encoded as rx_port_pin_t
 *                Must be previously configured as output via gpio_set_output()
 *
 * @return rx_err_t Write result
 * @retval k_rx_ok Pin output set to high
 * @retval k_rx_err_gpio_invalid_port Port number in pin is invalid
 * @retval k_rx_err_gpio_invalid_pin Pin number exceeds k_rx_pin_max
 *
 * @pre Pin must be configured as output via gpio_set_output()
 * @pre Port and pin numbers must be valid
 *
 * @post PODR bit for pin is set (output high)
 * @post Pin outputs VCC level (typically 3.3V)
 *
 * @note NOT thread-safe: Direct register write without synchronization
 * @note Performance: ~100 ns @ 240 MHz
 * @note ISR-safe: Can be called from interrupt handlers
 *
 * @warning No check that pin is configured as output
 * @warning Calling on input pin has no visible effect
 *
 * @par Example:
 * @code
 * // Turn on LED (active high)
 * rx_err_t err = gpio_write_high(RX_PORT_PIN(0, 3));
 * if (err != k_rx_ok) {
 *   // Handle error
 * }
 * @endcode
 *
 * @see gpio_write_low() Set output low
 * @see gpio_toggle() Toggle output state
 * @see gpio_set_output() Configure pin as output first
 *
 * @since Version 1.0.0
 */
rx_err_t gpio_write_high(const rx_port_pin_t pin)
{
  /* Extract port and pin number from rx_port_pin_t */
  const uint8_t port    = rx_port_from_pin(pin);
  const uint8_t pin_num = rx_pin_from_pin(pin);

  /* Validate parameters */
  const rx_err_t err = internal_validate_port_pin(port, pin_num);
  RX_RETURN_ON_ERROR(err, "GPIO", "Port/pin validation failed");

  /* Get port base address */
  volatile rx_port_regs_t* port_base = rx_port_get_base(port);

