Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/gpio.c
  const uint8_t pin_mask = (uint8_t)(k_gpio_bit_set << pin_num);
  port_base->podr |= pin_mask;

  return k_rx_ok;
}

/**
 * @brief Set GPIO output pin to logic low (0V)
 *
 * @details
 * Sets a GPIO output pin to logic low level. On the RX72N, this means
 * the pin outputs GND (0V). The pin must be configured as an output
 * before calling this function.
 *
 * ## Register Operation
 *
 * ```
 * PODR &= ~(1 << pin)  // Clear bit: Output low
 * ```
 *
 * ## Open-Drain Mode
 *
 * If the pin is configured for open-drain mode (ODR register), setting
 * low actively pulls the pin to GND. Setting high makes the pin float
 * (high-impedance), requiring an external pull-up.
 *
 * @param[in] pin Pin identifier encoded as rx_port_pin_t
 *                Must be previously configured as output via gpio_set_output()
 *
 * @return rx_err_t Write result
 * @retval k_rx_ok Pin output set to low
 * @retval k_rx_err_gpio_invalid_port Port number in pin is invalid
 * @retval k_rx_err_gpio_invalid_pin Pin number exceeds k_rx_pin_max
 *
 * @pre Pin must be configured as output via gpio_set_output()
 * @pre Port and pin numbers must be valid
 *
 * @post PODR bit for pin is cleared (output low)
 * @post Pin outputs GND level (0V)
 *
 * @note NOT thread-safe: Direct register write without synchronization
 * @note Performance: ~100 ns @ 240 MHz
 * @note ISR-safe: Can be called from interrupt handlers
 *
 * @warning No check that pin is configured as output
 * @warning Calling on input pin has no visible effect
 *
 * @par Example:
 * @code
 * // Turn off LED (active high)
 * rx_err_t err = gpio_write_low(RX_PORT_PIN(0, 3));
 * if (err != k_rx_ok) {
 *   // Handle error
 * }
 * @endcode
 *
 * @see gpio_write_high() Set output high
 * @see gpio_toggle() Toggle output state
 * @see gpio_set_output() Configure pin as output first
 *
 * @since Version 1.0.0
 */
rx_err_t gpio_write_low(const rx_port_pin_t pin)
{
  /* Extract port and pin number from rx_port_pin_t */
  const uint8_t port    = rx_port_from_pin(pin);
  const uint8_t pin_num = rx_pin_from_pin(pin);

  /* Validate parameters */
  const rx_err_t err = internal_validate_port_pin(port, pin_num);
  RX_RETURN_ON_ERROR(err, "GPIO", "Port/pin validation failed");

  /* Get port base address */
  volatile rx_port_regs_t* port_base = rx_port_get_base(port);

  const uint8_t pin_mask = (uint8_t)(k_gpio_bit_set << pin_num);
  port_base->podr &= (uint8_t)~pin_mask;

  return k_rx_ok;
}

/**
 * @brief Toggle GPIO output pin state (high↔low)
 *
 * @details
 * Inverts the current output state of a GPIO pin. If the pin is currently
 * high, it becomes low. If currently low, it becomes high. Uses XOR
 * operation for efficient toggling.
 *
 * ## Register Operation
 *
 * ```
 * PODR ^= (1 << pin)  // XOR bit: Toggle output
 * ```
 *
 * ## Atomicity Warning
 *
 * This operation is a read-modify-write sequence and is NOT atomic.
 * If an interrupt modifies the same port register between the read
 * and write, the interrupt's change may be lost.
 *
 * For thread-safe toggling, use explicit write_high/write_low with
 * external synchronization, or disable interrupts around the toggle.
 *
 * @param[in] pin Pin identifier encoded as rx_port_pin_t
 *                Must be previously configured as output via gpio_set_output()
 *
 * @return rx_err_t Toggle result
 * @retval k_rx_ok Pin output toggled successfully
 * @retval k_rx_err_gpio_invalid_port Port number in pin is invalid
 * @retval k_rx_err_gpio_invalid_pin Pin number exceeds k_rx_pin_max
 *
 * @pre Pin must be configured as output via gpio_set_output()
 * @pre Port and pin numbers must be valid
 *
 * @post PODR bit for pin is inverted
 * @post Pin output level is opposite of previous state
 *
 * @note NOT thread-safe: Read-modify-write operation
 * @note NOT atomic: Can race with ISRs on same port
 * @note Performance: ~150 ns @ 240 MHz
 *
 * @warning Race condition possible with ISRs modifying same port
 * @warning Use gpio_write_high/low with sync for critical applications
 *
 * @par Example:
 * @code
 * // Blink LED in loop
 * while (running) {
 *   gpio_toggle(RX_PORT_PIN(0, 3));  // Toggle LED
 *   tx_thread_sleep(50);             // 50ms delay (20 Hz blink)
 * }
 * @endcode
 *
 * @see gpio_write_high() Set output high explicitly
 * @see gpio_write_low() Set output low explicitly
 * @see gpio_read() Read current output state
 *
 * @since Version 1.0.0
 */
rx_err_t gpio_toggle(const rx_port_pin_t pin)
{
  /* Extract port and pin number from rx_port_pin_t */
  const uint8_t port    = rx_port_from_pin(pin);
  const uint8_t pin_num = rx_pin_from_pin(pin);

  /* Validate parameters */
  const rx_err_t err = internal_validate_port_pin(port, pin_num);
  RX_RETURN_ON_ERROR(err, "GPIO", "Port/pin validation failed");

  /* Get port base address */
  volatile rx_port_regs_t* port_base = rx_port_get_base(port);

  const uint8_t pin_mask = (uint8_t)(k_gpio_bit_set << pin_num);
  port_base->podr ^= pin_mask;

  return k_rx_ok;
}

/**
 * @brief Read GPIO input pin state
 *
 * @details
 * Reads the current logic level of a GPIO pin. Uses the PIDR (Port Input Data
 * Register) which reflects the actual voltage level on the pin, regardless
 * of whether the pin is configured as input or output.
 *
 * ## Register Operation
 *
 * ```
 * value = (PIDR & (1 << pin)) != 0
 * ```
 *
 * ## Input vs Output Reading
 *
 * - **Input pin**: PIDR reflects external voltage on pin
 * - **Output pin**: PIDR reflects actual pin state (may differ from PODR
 *   if pin is shorted or overdriven)
 *
 * ## Voltage Thresholds (RX72N)
 *
 * | Level | Voltage Range | Returned Value |
 * |-------|---------------|----------------|
 * | Low | 0V to ~0.8V | false |
 * | High | ~2.0V to VCC | true |
 * | Undefined | 0.8V to 2.0V | Unpredictable |
 *
 * @param[in] pin Pin identifier encoded as rx_port_pin_t
 * @param[out] value Pointer to store pin state
 *                   - true: Pin is at logic high (>2.0V typically)
 *                   - false: Pin is at logic low (<0.8V typically)
 *
 * @return rx_err_t Read result
 * @retval k_rx_ok Pin state read successfully
 * @retval k_rx_err_null_ptr value pointer is nullptr
 * @retval k_rx_err_gpio_invalid_port Port number in pin is invalid
 * @retval k_rx_err_gpio_invalid_pin Pin number exceeds k_rx_pin_max
 *
 * @pre value must be non-NULL pointer
 * @pre Pin should be configured as input for external signals
 *
 * @post *value contains current pin level (true=high, false=low)
 * @post No hardware state changes
 *
 * @note Thread-safe: Read-only operation
 * @note Performance: ~100 ns @ 240 MHz
 * @note ISR-safe: Can be called from interrupt handlers
 *
 * @warning Floating inputs may return unpredictable values
 * @warning Use pull-up/pull-down for stable readings on open pins
 *
 * @par Example:
 * @code
 * // Read button state (active low with pull-up)
 * bool button_pressed;
 * rx_err_t err = gpio_read(RX_PORT_PIN(2, 0), &button_pressed);
 *
 * if (err == k_rx_ok) {
 *   // Invert because button is active low
 *   if (!button_pressed) {
 *     rx_log_info("BTN", "Button pressed");
 *     handle_button_press();
 *   }
 * }
 * @endcode
 *
 * @par Example: Debounced button read
 * @code
 * bool debounced_read(rx_port_pin_t pin) {
 *   bool first, second;
 *   gpio_read(pin, &first);
 *   tx_thread_sleep(1);  // 1 tick delay
 *   gpio_read(pin, &second);
 *   return (first == second) ? first : false;  // Only return if stable
 * }
 * @endcode
 *
 * @see gpio_set_input() Configure pin as input first
 * @see gpio_write_high() Set output high
 * @see gpio_write_low() Set output low
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 2 preconditions, 2 postconditions
 */
rx_err_t gpio_read(const rx_port_pin_t pin, bool* value)
{
  /* Check null pointer */
  RX_CHECK_NULL_PTR(value, "GPIO", "Value pointer is nullptr");

  /* Extract port and pin number from rx_port_pin_t */
  const uint8_t port    = rx_port_from_pin(pin);
  const uint8_t pin_num = rx_pin_from_pin(pin);

  /* Validate parameters */
  const rx_err_t err = internal_validate_port_pin(port, pin_num);
  RX_RETURN_ON_ERROR(err, "GPIO", "Port/pin validation failed");

  /* Get port base address */
  const volatile rx_port_regs_t* port_base = rx_port_get_base(port);

  const uint8_t pin_mask = (uint8_t)(k_gpio_bit_set << pin_num);
  *value = (port_base->pidr & pin_mask) != k_gpio_bit_clear;

  return k_rx_ok;
}
